__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
the_input (InputLayer)          (None, 100, 32, 1)   0                                            
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 50, 16, 1)    0           the_input[0][0]                  
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 46, 12, 20)   520         max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 23, 6, 20)    0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 19, 2, 20)    10020       max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 760)          0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 50)           38050       flatten_1[0][0]                  
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 50)           0           dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 6)            306         activation_1[0][0]               
__________________________________________________________________________________________________
bilinear_interpolation_1 (Bilin (None, 100, 32, 1)   0           the_input[0][0]                  
                                                                 dense_2[0][0]                    
__________________________________________________________________________________________________
zero_padding2d_1 (ZeroPadding2D (None, 104, 36, 1)   0           bilinear_interpolation_1[0][0]   
__________________________________________________________________________________________________
depthwise_conv2d_1 (DepthwiseCo (None, 104, 36, 1)   9           zero_padding2d_1[0][0]           
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 104, 36, 1)   4           depthwise_conv2d_1[0][0]         
__________________________________________________________________________________________________
re_lu_1 (ReLU)                  (None, 104, 36, 1)   0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 104, 36, 64)  64          re_lu_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 104, 36, 64)  256         conv2d_3[0][0]                   
__________________________________________________________________________________________________
re_lu_2 (ReLU)                  (None, 104, 36, 64)  0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 104, 36, 64)  0           re_lu_2[0][0]                    
__________________________________________________________________________________________________
depthwise_conv2d_2 (DepthwiseCo (None, 104, 36, 64)  576         dropout_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 104, 36, 64)  256         depthwise_conv2d_2[0][0]         
__________________________________________________________________________________________________
re_lu_3 (ReLU)                  (None, 104, 36, 64)  0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 104, 36, 128) 8192        re_lu_3[0][0]                    
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 104, 36, 128) 512         conv2d_4[0][0]                   
__________________________________________________________________________________________________
re_lu_4 (ReLU)                  (None, 104, 36, 128) 0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 104, 36, 128) 0           re_lu_4[0][0]                    
__________________________________________________________________________________________________
depthwise_conv2d_3 (DepthwiseCo (None, 104, 36, 128) 1152        dropout_2[0][0]                  
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 104, 36, 128) 512         depthwise_conv2d_3[0][0]         
__________________________________________________________________________________________________
re_lu_5 (ReLU)                  (None, 104, 36, 128) 0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 104, 36, 256) 32768       re_lu_5[0][0]                    
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 104, 36, 256) 1024        conv2d_5[0][0]                   
__________________________________________________________________________________________________
re_lu_6 (ReLU)                  (None, 104, 36, 256) 0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 52, 18, 256)  0           re_lu_6[0][0]                    
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 52, 18, 256)  0           max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
depthwise_conv2d_4 (DepthwiseCo (None, 52, 18, 256)  2304        dropout_3[0][0]                  
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 52, 18, 256)  1024        depthwise_conv2d_4[0][0]         
__________________________________________________________________________________________________
re_lu_7 (ReLU)                  (None, 52, 18, 256)  0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 52, 18, 256)  65536       re_lu_7[0][0]                    
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 52, 18, 256)  1024        conv2d_6[0][0]                   
__________________________________________________________________________________________________
re_lu_8 (ReLU)                  (None, 52, 18, 256)  0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 52, 18, 256)  0           re_lu_8[0][0]                    
__________________________________________________________________________________________________
depthwise_conv2d_5 (DepthwiseCo (None, 52, 18, 256)  2304        dropout_4[0][0]                  
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 52, 18, 256)  1024        depthwise_conv2d_5[0][0]         
__________________________________________________________________________________________________
re_lu_9 (ReLU)                  (None, 52, 18, 256)  0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 52, 18, 512)  131072      re_lu_9[0][0]                    
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 52, 18, 512)  2048        conv2d_7[0][0]                   
__________________________________________________________________________________________________
re_lu_10 (ReLU)                 (None, 52, 18, 512)  0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 52, 9, 512)   0           re_lu_10[0][0]                   
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 52, 9, 512)   0           max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
depthwise_conv2d_6 (DepthwiseCo (None, 52, 9, 512)   4608        dropout_5[0][0]                  
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 52, 9, 512)   2048        depthwise_conv2d_6[0][0]         
__________________________________________________________________________________________________
re_lu_11 (ReLU)                 (None, 52, 9, 512)   0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 52, 9, 512)   262144      re_lu_11[0][0]                   
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 52, 9, 512)   2048        conv2d_8[0][0]                   
__________________________________________________________________________________________________
re_lu_12 (ReLU)                 (None, 52, 9, 512)   0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 52, 9, 512)   0           re_lu_12[0][0]                   
__________________________________________________________________________________________________
depthwise_conv2d_7 (DepthwiseCo (None, 52, 9, 512)   4608        dropout_6[0][0]                  
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 52, 9, 512)   2048        depthwise_conv2d_7[0][0]         
__________________________________________________________________________________________________
re_lu_13 (ReLU)                 (None, 52, 9, 512)   0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 52, 9, 512)   262144      re_lu_13[0][0]                   
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 52, 9, 512)   2048        conv2d_9[0][0]                   
__________________________________________________________________________________________________
re_lu_14 (ReLU)                 (None, 52, 9, 512)   0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 52, 9, 512)   0           re_lu_14[0][0]                   
__________________________________________________________________________________________________
reshape (Reshape)               (None, 52, 4608)     0           dropout_7[0][0]                  
__________________________________________________________________________________________________
dense1 (Dense)                  (None, 52, 128)      589952      reshape[0][0]                    
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 52, 128)      0           dense1[0][0]                     
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (None, 52, 256)      591360      dropout_8[0][0]                  
__________________________________________________________________________________________________
bidirectional_2 (Bidirectional) (None, 52, 512)      787968      bidirectional_1[0][0]            
__________________________________________________________________________________________________
dropout_9 (Dropout)             (None, 52, 512)      0           bidirectional_2[0][0]            
__________________________________________________________________________________________________
dense2 (Dense)                  (None, 52, 38)       19494       dropout_9[0][0]                  
__________________________________________________________________________________________________
softmax (Activation)            (None, 52, 38)       0           dense2[0][0]                     
__________________________________________________________________________________________________
the_labels (InputLayer)         (None, 20)           0                                            
__________________________________________________________________________________________________
input_length (InputLayer)       (None, 1)            0                                            
__________________________________________________________________________________________________
label_length (InputLayer)       (None, 1)            0                                            
__________________________________________________________________________________________________
ctc (Lambda)                    (None, 1)            0           softmax[0][0]                    
                                                                 the_labels[0][0]                 
                                                                 input_length[0][0]               
                                                                 label_length[0][0]               
==================================================================================================
Total params: 2,831,027
Trainable params: 2,823,089
Non-trainable params: 7,938
__________________________________________________________________________________________________
